transonic-bump/setups.orig/kEpsilonPhitF/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;

}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

//internalField   uniform 6e4;
internalField   uniform 469.872; // computed from omega and k



boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;

//        type calculated;
//        value $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;

//        type zeroGradient;
    }

    top
    {
        type symmetry;
    }
    obstacle
    {
        type            epsilonWallFunction;
        value           $internalField;
        lowReCorrection on;

        //type zeroGradient;
//        type epsilonWallFunction;
//        value $internalField;
    }

    upwall
    {
        type            symmetry;
    }

    downwall
    {
        type            symmetry;
    }




    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}

// ************************************************************************* //
