transonic-bump/setups.orig/kEpsilonPhitF/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      mut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 4.86e-6;



boundaryField
{
    inlet
    {
        type calculated;
        value $internalField;
    }
    outlet
    {
        type            calculated;
        value           $internalField;
    }


    top
    {
        type symmetry;
    }
    obstacle
    {
        //type zeroGradient;
//        type nutkWallFunction;
//        value $internalField;
        type            nutLowReWallFunction;
        value           uniform 0;

    }

    upwall
    {
        type            symmetry;
    }

    downwall
    {
        type            symmetry;
    }



    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}

// ************************************************************************* //
